docs/phys210/KBe21phys250retSpecialRelativityProblem.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-11 Sat 08:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Special Relativity Problem: Linear Escape</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Exr0n" />
<link rel="stylesheet" href="../global.css" type="text/css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://taproot3.sanity.gq/sitemap.html"> UP </a>
 |
 <a accesskey="H" href="https://taproot3.sanity.gq/theindex.html"> HOME </a>
</div><div id="content">
<h1 class="title">Special Relativity Problem: Linear Escape</h1>
<p>
To test his prized cows' intelligence, Farmer John has trapped Bessie and Elsie in an escape room!
</p>

<p>
The escape room is a long tunnel in which the cows are traveling&#x2013;Bessie at -0.4c and Elsie at 0.6c. At the start of the puzzle, both cows are at position zero in the tunnel where Farmer John is observing. To escape, Bessie has to turn on a light so Elsie sees it exactly six seconds after the challenge begins. Then, Farmer John will be satisfied that his cows are properly educated.
</p>

<ol class="org-ol">
<li>Bessie has a terrible sense of time and can only measure how far she has gone by regular 1-lightsecond markings on the tunnel wall. How far from the start should Bessie be when she turns on the light?</li>

<li>Farmer John realizes that the previous rendition of the escape room was too mentally taxing on Bessie. That afternoon, he repeats the test but provides Bessie with a long measuring stick to take with her. As measured by the stick, how far from the start should Bessie be when she turns on the light?</li>

<li>If you have too much time on your hands: Bessie successfully completes the challenge and returns to the barn for for the evening. Elsie sleeps peacefully on the on the bunk below her, but Bessie realizes that Farmer John has let her off easy. Taking light travel time into account, where along the measuring stick should the start have been when Bessie turned on the light?</li>
</ol>
</div>
<div id="postamble" class="status">
<div class="namedate"><p class="subtitle"><span class="author">Exr0n</span><span class="date">2021-09-11 Sat 08:10</span></p></div><div class="taprootcopyright">(c) 2021 Houjun Liu, Huxley Marvit, Zachary Sayyah, Albert Huang, Dylan Wallace</div>
</div>
</body>
</html>
